import React from "react";
import ReactDOM from "react-dom/client";
import { BrowserRouter } from "react-router-dom";
import App from "./App.jsx";

ReactDOM.createRoot(document.getElementById("root")).render(
  <React.StrictMode>
    <BrowserRouter>
      <App />
    </BrowserRouter>
  </React.StrictMode>
  //                                      . . . .
  //                                     ,`,`,`,`,
  //               . . . .               `\`\`\`\;
  //               `\`\`\`\`,            ~|;!;!;\!
  //                ~\;\;\;\|\          (--,!!!~`!       .
  //               (--,\\\===~\         (--,|||~`!     ./
  //                (--,\\\===~\         `,-,~,=,:. _,//
  //                 (--,\\\==~`\        ~-=~-.---|\;/J,
  //                  (--,\\\((```==.    ~'`~/       a |
  //                    (-,.\\('('(`\\.  ~'=~|     \_.  \
  //                       (,--(,(,(,'\\. ~'=|       \\_;>
  //                         (,-( ,(,(,;\\ ~=/        \
  //                         (,-/ (.(.(,;\\,/          )
  //                          (,--/,;,;,;,\\         ./------.
  //                            (==,-;-'`;'         /_,----`. \
  //                    ,.--_,__.-'                    `--.  ` \
  //                   (='~-_,--/        ,       ,!,___--. \  \_)
  //                  (-/~(     |         \   ,_-         | ) /_|
  //                  (~/((\    )\._,      |-'         _,/ /
  //                   \\))))  /   ./~.    |           \_\;
  //                ,__/////  /   /    )  /
  //                 '===~'   |  |    (, <.
  //                          / /       \. \
  //                        _/ /          \_\
  //                       /_!/            >_\
  //                      神獸保佑，程式碼沒Bug!
);
